hiperiondev/esp32idf_APRS/main/aprs_service.c
#include <stdio.h>
#include <string.h>

#include "esp_log.h"
#include "esp_random.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

#include "afsk.h"
#include "ax25.h"
#include "esp32idf_radioamateur_modem.h"
#include "esp32idf_radioamateur_modem_config.h"
#include "modem.h"

#include "app_config.h"
#include "aprs_service.h"
#include "beacon.h"
#include "digirepeater.h"
#include "igate.h"
#include "lastheard.h"
#include "message.h"
#include "trafficlog.h"

static const char *TAG = "aprs_service";

// ---------------------------------------------------------------------------
// Modem configuration
//
// Single mapping point from g_config to the component's modem_config_t, used
// by main.c at boot, by page_radio.c's Save (live re-apply, no reboot) and by
// the LOOP TEST below (which only overrides full_duplex).
//
// Deliberately NOT mapped, because the new component takes none of them at
// runtime:
//   adc_gpio / dac_gpio / rf_ptt_gpio / rf_ptt_active
//       -> compile-time MODEM_ADC_GPIO / MODEM_DAC_GPIO / MODEM_PTT_GPIO /
//          MODEM_PTT_ACTIVE_HIGH, set in the top-level CMakeLists.txt.
//   rf_sql_gpio / rf_sql_active / rf_pwr_gpio / rf_pwr_active
//       -> no equivalent at all. The component gates RX on the demodulator's
//          own DCD rather than on a hardware squelch line, and has no RF
//          power-switch output.
//   adc_atten -> compile-time MODEM_ADC_ATTEN (ADC_ATTEN_DB_12).
//   sql_level / volume / agc_max_gain -> no equivalent. The component's AGC is
//          self-limiting and there is no software squelch or RX gain trim.
// Those g_config fields are still loaded/saved so an existing config.json keeps
// working, and page_mod.c still edits the pin numbers, but nothing in the audio
// modem path reads them any more.
// ---------------------------------------------------------------------------
void aprs_service_build_modem_config(modem_config_t *cfg, bool full_duplex) {
    modem_config_t base = MODEM_DEFAULT_CONFIG();
    *cfg = base;

    // afskModem on the Radio page: 0=300 Bd, 1=1200 Bd Bell202, 2=1200 Bd V.23,
    // 3=9600 Bd G3RUH. modem_mode_t uses exactly the same numbering
    // (MODEM_MODEM_AFSK300=0 .. MODEM_MODEM_G3RUH=3), which is why this is a
    // plain cast; page_radio.c already clamps the field to 0-3.
    cfg->modem = (modem_mode_t)g_config.afsk_modem_type;

    // audioLPF fed the old afskSetModem()'s bpf argument, which that function
    // assigned straight to ModemConfig.flatAudioIn - i.e. despite the name it
    // always was the flat-audio-input flag, and modem_config_t.flat_audio is
    // the same bit. Kept as a direct mapping so the saved setting keeps its
    // existing meaning.
    cfg->flat_audio = g_config.audio_lpf;

    cfg->preamble_ms = g_config.preamble;
    cfg->slot_time_ms = g_config.tx_timeslot;
    cfg->fx25_mode = g_config.fx25_mode;
    cfg->allow_non_aprs = false;

    // Half duplex for real on-air use: MODEM_DEFAULT_CONFIG() ships full
    // duplex (it targets the wire-loopback demo), which would key up over
    // anyone already transmitting. CSMA/quiet time comes from txTimeSlot.
    // The LOOP TEST passes true here because a DAC->ADC wire means the node
    // always hears its own carrier and would never see a clear channel.
    cfg->full_duplex = full_duplex;
}

void aprs_service_apply_modem_config(void) {
    if (!aprs_service_modem_ready())
        return;
    modem_config_t cfg;
    aprs_service_build_modem_config(&cfg, false);
    modem_set_modem(&cfg);
    ESP_LOGI(TAG, "modem re-applied: modem=%u flatAudio=%d preamble=%ums slot=%ums fx25=%u", (unsigned)cfg.modem, (int)cfg.flat_audio,
             (unsigned)cfg.preamble_ms, (unsigned)cfg.slot_time_ms, (unsigned)cfg.fx25_mode);
}

// Set true once main.c has actually called modem_init() successfully (i.e.
// the audio modem is enabled in config *and* the hardware came up since boot -
// toggling the checkbox without rebooting does not re-run modem_init).
static volatile bool s_modemReady = false;

// ---------------------------------------------------------------------------
// TX helper
//
// The old APRS_sendTNC2Pkt(raw, len) took a pointer+length; the component's
// modem_send_tnc2() takes a NUL-terminated string (it copies into a scratch
// buffer for ax25_encode(), which uses strtok on the digipeater path). Callers
// here hand us slices of larger buffers that are not always NUL-terminated at
// exactly `len`, so terminate explicitly rather than trusting the caller.
//
// Exported (beacon.c calls it too) so the pointer+length -> NUL-terminated
// conversion and the length check live in exactly one place.
// ---------------------------------------------------------------------------
void aprs_service_send_tnc2(const char *packet, size_t len) {
    char buf[AX25_FRAME_MAX_SIZE];

    if (len == 0)
        return;

    // Drop rather than queue when the modem was never brought up. Two ways to
    // get here: the audio modem is disabled on the Radio page, or - and this
    // is the one that bites - aprs_service_start() now runs BEFORE
    // modem_init() (it has to: it installs the RX callback), and it starts the
    // beacon tasks, which transmit immediately on entry rather than after
    // their first interval. modem_init() blocks for ~5 s measuring the ADC
    // clock, so without this a boot-time beacon would reach
    // Ax25WriteTxFrame() before Ax25Init() had run.
    if (!s_modemReady) {
        ESP_LOGD(TAG, "modem not up, RF TX dropped: %.*s", (int)len, packet);
        return;
    }
    if (len >= sizeof(buf)) {
        ESP_LOGW(TAG, "TNC2 packet too long (%u bytes), dropped", (unsigned)len);
        return;
    }
    memcpy(buf, packet, len);
    buf[len] = 0;

    esp_err_t err = modem_send_tnc2(buf);
    if (err != ESP_OK)
        ESP_LOGW(TAG, "modem_send_tnc2() failed: %s (\"%s\")", esp_err_to_name(err), buf);
}

// ---------------------------------------------------------------------------
// AX25Msg -> TNC2 text line ("SRC-N>DST-N,PATH...:info"), shared by the digi
// re-transmit path, the igate RF->INET path (igate.c builds its own header
// internally) and message parsing (which works on TNC2 text either way).
//
// This used to be a local ax25ToTnc2(); the component now ships exactly the
// same rendering as modem_format_tnc2(), so this is a thin length-returning
// wrapper over it rather than a second copy that could drift.
// ---------------------------------------------------------------------------
static int ax25ToTnc2(const ax25_msg_t *m, char *out, size_t outMax) {
    modem_format_tnc2(m, out, outMax);
    return (int)strlen(out);
}

/**
 * @brief Single dispatch point for digipeater / igate / message, fed by
 * on_rx_frame() below for every decoded RX frame.
 */
static void aprs_msg_callback(ax25_msg_t *msg) {
    char tnc2[400];
    ax25ToTnc2(msg, tnc2, sizeof(tnc2));

