hiperiondev/esp32idf_APRS/main/aprs_service.c
    // Source callsign (with SSID), used both for the LAST HEARD table and
    // as the DX field of the traffic-table entry below.
    char callsign[12];
    if (msg->src.ssid > 0)
        snprintf(callsign, sizeof(callsign), "%s-%d", msg->src.call, msg->src.ssid);
    else
        snprintf(callsign, sizeof(callsign), "%s", msg->src.call);

    // Position/object/item reports start their info field with one of
    // !=/@; the next two bytes are the symbol table and symbol code.
    // Only handle the no-timestamp position formats ('!' / '=') here;
    // '/' and '@' carry a 7-byte timestamp before the position and are
    // left unparsed (icon stays blank for those).
    char symTable = 0, symCode = 0;
    if ((msg->info[0] == '!' || msg->info[0] == '=') && msg->len >= 20) {
        symTable = msg->info[9];
        symCode = msg->info[19];
    }

    // Log every decoded RF frame so the web traffic viewer mirrors what the
    // serial console shows for RF activity, regardless of which
    // feature(s) below end up acting on it. AUDIO is the demodulated
    // signal level (mV RMS) reported by the AFSK/GFSK modem for this frame.
    ESP_LOGI(TAG, "RX: %s", tnc2);
    trafficlog_add_pkt("RX", callsign, tnc2, (int)msg->mVrms, symTable, symCode);

    // Feed the web dashboard's "LAST HEARD" table (see components/lastheard).
    {
        char path[48] = "";
        size_t plen = 0;
        for (int i = 0; i < msg->rpt_count && plen + 1 < sizeof(path); i++) {
            plen += snprintf(&path[plen], sizeof(path) - plen, "%s%s", (i == 0) ? "" : ",", msg->rpt_list[i].call);
            if (msg->rpt_list[i].ssid > 0 && plen + 1 < sizeof(path))
                plen += snprintf(&path[plen], sizeof(path) - plen, "-%d", msg->rpt_list[i].ssid);
        }

        lastheard_add(callsign, path, true, symTable, symCode);
    }

    if (g_config.digi_en) {
        int action = digiProcess(msg);
        if (action == 2) {
            // Path was rewritten in place; re-transmit the modified frame on RF.
            int len = ax25ToTnc2(msg, tnc2, sizeof(tnc2));
            aprs_service_send_tnc2(tnc2, (size_t)len);
            ESP_LOGD(TAG, "DIGI TX: %s", tnc2);
            trafficlog_add_pkt("DIGI", callsign, tnc2, -1, symTable, symCode);
        }
    }

    if (g_config.igate_en && g_config.rf2inet) {
        igateProcess(msg); // builds its own qAR/qAO header and sends to APRS-IS internally
    }

    if (g_config.msg_enable) {
        ax25ToTnc2(msg, tnc2, sizeof(tnc2));
        handleIncomingAPRS(tnc2);
    }
}

// ---------------------------------------------------------------------------
// Component RX callback.
//
// The old component decoded frames itself and invoked a global ax25_callback_t
// (_hook) with a ready-made AX25Msg. The new one hands back the raw AX.25
// bytes and leaves the decode to us, so this does the ax25_decode() the old
// LibAPRS.c used to do internally, then dispatches exactly as before.
//
// Runs on the component's "modem_svc" task, whose stack the component sizes at
// 6144 bytes - enough for the ax25_msg_t below (~700 B) plus the rest of the
// dispatch chain, but worth remembering before adding anything large here.
//
// s_rxHook replaces the old `extern ax25_callback_t _hook` the LOOP TEST used
// to reach into the component and swap out. The indirection is ours now: the
// component's callback stays installed for the life of the process and only
// this pointer moves.
// ---------------------------------------------------------------------------
typedef void (*aprs_rx_hook_t)(ax25_msg_t *msg);
static volatile aprs_rx_hook_t s_rxHook = aprs_msg_callback;

static void on_rx_frame(const modem_rx_frame_t *f, void *ctx) {
    (void)ctx;
    ax25_msg_t msg;

    memset(&msg, 0, sizeof(msg));
    ax25_decode((uint8_t *)f->frame, f->len, f->mVrms, &msg);

    aprs_rx_hook_t hook = s_rxHook;
    if (hook)
        hook(&msg);
}

// ---------------------------------------------------------------------------
// INET -> RF: called by igate.c for every non-comment line read from APRS-IS.
// ---------------------------------------------------------------------------
static void inet2rfHandler(const char *line) {
    // Feed the dashboard LAST HEARD table from APRS-IS too, not just RF, so
    // there's something to see while verifying the IGate uplink even before
    // the local radio has decoded anything. TNC2 line looks like
    // "SRC-N>DST,PATH,qAR,SERVER:info" - split at '>' for the callsign and
    // at ':' for the via/path, matching what aprs_msg_callback does for RF.
    char callsign[12] = "";
    char symTable = 0, symCode = 0;
    {
        const char *gt = strchr(line, '>');
        const char *colon = strchr(line, ':');
        if (gt && colon && colon > gt) {
            size_t callLen = (size_t)(gt - line);
            if (callLen >= sizeof(callsign))
                callLen = sizeof(callsign) - 1;
            memcpy(callsign, line, callLen);
            callsign[callLen] = 0;

            char path[48];
            size_t pathLen = (size_t)(colon - gt - 1);
            if (pathLen >= sizeof(path))
                pathLen = sizeof(path) - 1;
            memcpy(path, gt + 1, pathLen);
            path[pathLen] = 0;

            const char *info = colon + 1;
            size_t infoLen = strlen(info);
            if ((info[0] == '!' || info[0] == '=') && infoLen >= 20) {
                symTable = info[9];
                symCode = info[19];
            }

            lastheard_add(callsign, path, false, symTable, symCode);
        }
    }

    if (g_config.msg_enable)
        handleIncomingAPRS(line);

    if (g_config.inet2rf) {
        // NOTE: g_config.inet2rfFilter (object/item/message/etc bitmask) is not
        // yet applied here; add a filter check before this call if selective
        // gating is required.
        aprs_service_send_tnc2(line, strlen(line));
        ESP_LOGD(TAG, "INET2RF TX: %s", line);
        trafficlog_add_pkt("INET2RF", callsign, line, -1, symTable, symCode);
    }
}

// ---------------------------------------------------------------------------
// Outbound message TX: message.c hands us a built TNC2 packet + channel mask.
// ---------------------------------------------------------------------------
static void messageTxHandler(const char *packet, size_t len, uint8_t channels) {
    if (channels & MSG_CHANNEL_RF)
        aprs_service_send_tnc2(packet, len);
    if (channels & MSG_CHANNEL_INET)
        igate_send_raw(packet, len);
}

